examples/stacked/heatMassTransfer/0/air/T
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location "0/air";
 object T;
}

dimensions [ 0 0 0 1 0 0 0 ];

internalField uniform 279.15;

boundaryField
{
  inlet
  {
    type fixedValue;
    value uniform 279.15;
  }
  outlet
  {
    type inletOutlet;
    inletValue uniform 279.15;
    value $internalField;
  }
  symm_plane
  {
    type symmetryPlane;
  }
  top_bottom
  {
    type zeroGradient;
  }
  air_to_solution
  {
    type regionCoupleTemperature;
    neighbourRegionName solution;
    neighbourPatchName solution_to_air;
    neighbourFieldName T;
    relaxationFactor 0.5;
    value uniform 276.15;
  }
} 	// ************************************************************************* //

