examples/stacked/heatMassTransfer/0/air/cw
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location "0/air";
 object cw;
}

dimensions [ 0 0 0 0 0 0 0 ];

internalField uniform 0.004707978971483788;

boundaryField
{
  inlet
  {
    type fixedValue;
    value uniform 0.004707978971483788;
  }
  outlet
  {
    type inletOutlet;
    value $internalField;
    inletValue uniform 0.004707978971483788;
  }
  symm_plane
  {
    type symmetryPlane;
  }
  top_bottom
  {
    type zeroGradient;
  }
  air_to_solution
  {
    type regionCoupleVaporPressure;
    neighbourRegionName solution;
    neighbourPatchName solution_to_air;
    neighbourFieldName pw;
    relaxationFactor 0.5;
    value $internalField;
  }
} 	// ************************************************************************* //

