examples/stacked/heatMassTransfer/0/solution/T
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location "0/solution";
 object T;
}

dimensions [ 0 0 0 1 0 0 0 ];

internalField uniform 275.15;

boundaryField
{
  inlet
  {
    type fixedValue;
    value uniform 275.15;
  }
  outlet
  {
    type zeroGradient;
    value $internalField;
  }
  wall
  {
    type fixedValue;
    value uniform 271.15;
  }
  front_back
  {
    type zeroGradient;
  }
  solution_to_air
  {
    type regionCoupleHeatFluxLatent;
    neighbourRegionName air;
    neighbourPatchName air_to_solution;
    neighbourFieldName T;
    value uniform 276.15;
  }
} 	// ************************************************************************* //

