examples/stacked/heatMassTransfer/0/solution/cw
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location "0/solution";
 object cw;
}

dimensions [ 0 0 0 0 0 0 0 ];

internalField uniform 0.30300000000000005;

boundaryField
{
  inlet
  {
    type fixedValue;
    value uniform 0.30300000000000005;
  }
  outlet
  {
    type zeroGradient;
    value $internalField;
  }
  wall
  {
    type zeroGradient;
  }
  front_back
  {
    type zeroGradient;
  }
  solution_to_air
  {
    type regionCoupleMassFluxPicard;
    neighbourRegionName air;
    neighbourPatchName air_to_solution;
    neighbourFieldName cw;
    value $internalField;
  }
} 	// ************************************************************************* //

