examples/stacked/heatMassTransfer/constant/solution/thermophysicalProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object thermophysicalProperties;
}

mixture
{
  equationOfState
  {
    rho rho         [ 1 -3 0 0 0 0 0 ]         1114.90161382935 ;
  }
  transport
  {
    flagMedium 0;
    lambda lambda         [ 1 1 -3 -1 0 0 0 ]         0.31382435347142856 ; 	// 0-IL using fit / 1-IL using bilinear / 2-LiBr using Ernst Hofmann fit
    TDiff TDiff         [ 0 2 -1 0 0 0 0 ]         1.152065436504351e-07 ; 	// kg/m3// W/mK// m2/s
    cwDiff cwDiff         [ 0 2 -1 0 0 0 0 ]         8.34e-11 ; 	// m2/s
    p0 p0         [ 1 -1 -2 0 0 0 0 ]         100000.0 ; 	// Pa
    nu nu         [ 0 2 -1 0 0 0 0 ]         2.799650043744532e-05 ;
  }
  vaporPressureFit
  {
    k0A k0A         [ 0 0 0 0 0 0 0 ]         82.2798871 ;
    k1A k1A         [ 0 0 0 0 0 0 0 ]         -74.7277833 ;
    k2A k2A         [ 0 0 0 0 0 0 0 ]         -0.106593305 ;
    k3A k3A         [ 0 0 0 0 0 0 0 ]         0 ;
    k0B k0B         [ 0 0 0 1 0 0 0 ]         282680.087 ;
    k1B k1B         [ 0 0 0 1 0 0 0 ]         -546796.304 ;
    k2B k2B         [ 0 0 0 1 0 0 0 ]         265133.828 ;
    k3B k3B         [ 0 0 0 1 0 0 0 ]         0 ;
    k0C k0C         [ 0 0 0 1 0 0 0 ]         3291.91666 ;
    k1C k1C         [ 0 0 0 1 0 0 0 ]         -3534.7899 ;
    k2C k2C         [ 0 0 0 1 0 0 0 ]         0 ;
    k3C k3C         [ 0 0 0 1 0 0 0 ]         0 ;
    D D         [ 1 -1 -2 0 0 0 0 ]         0 ;
  }
}



// ************************************************************************* //