examples/stacked/heatMassTransfer/system/controlDict.checkVolumeFlow
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     heatMassTransferFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         200;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

libs ("customBoundaryConditions.so");

functions
{
	InletFlowRate
	{
		type            surfaceFieldValue;
		libs            ("libfieldFunctionObjects.so");

		log             true;
		writeControl    writeTime;
		writeFields     false;

		region			solution;
		regionType      patch;
		name            inlet;

		operation       sum;

		fields
		(
			phi
		);
	}
	OutletFlowRate
	{
		type            surfaceFieldValue;
		libs            ("libfieldFunctionObjects.so");

		log             true;
		writeControl    writeTime;
		writeFields     false;

		region			solution;
		regionType      patch;
		name            outlet;

		operation       sum;

		fields
		(
			phi
		);
	}
	InletFlowRateAir
	{
		type            surfaceFieldValue;
		libs            ("libfieldFunctionObjects.so");

		log             true;
		writeControl    writeTime;
		writeFields     false;

		region			air;
		regionType      patch;
		name            inlet;

		operation       sum;

		fields
		(
			phi
		);
	}
	OutletFlowRateAir
	{
		type            surfaceFieldValue;
		libs            ("libfieldFunctionObjects.so");

		log             true;
		writeControl    writeTime;
		writeFields     false;

		region			air;
		regionType      patch;
		name            outlet;

		operation       sum;

		fields
		(
			phi
		);
	}
}

// ************************************************************************* //
