examples/stacked/heatMassTransfer/system/solution/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
	// A bit less accurate
	grad(cw)        Gauss linear;
	grad(T)        	Gauss linear;
	// More accurate
	//grad(cw)        leastSquares;
	//grad(T)        	leastSquares;
	// Even more accurate
	//grad(cw)        fourth;
	//grad(T)        	fourth;	
}

divSchemes
{
    default         none;
	
	// Only first order accurate but stable
  	div(phi,cw)   bounded Gauss upwind;
	div(phi,T)    bounded Gauss upwind;
	
	// Very accurate, second order, but unstable
  	//div(phi,cw)     bounded Gauss limitedLinear 1;
	//div(phi,T)    Gauss limitedLinear 1;
	
	// Second order accurate but more stable
	//div(phi,cw)   bounded Gauss linearUpwind grad(cw);
	//div(phi,T)    bounded Gauss linearUpwind grad(T);
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
    //default         Gauss cubic orthogonal;
}

interpolationSchemes
{
    default         linear;
    //default         cubic;
}

snGradSchemes
{
    default        	orthogonal;
    //default        	fourth;
}


// ************************************************************************* //
